IDENTIFICATION DIVISION.
        PROGRAM-ID. CRLOCK.

      * File Creation for Student File
      * AUTHOR    DATE     TYPE   ACC   NOTES
      * MUNA   13/10/2025   -      PA    SP2

       ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
         FILE-CONTROL.
           COPY '/z/y25b31/sp2/lib/fd/fclock'.

       DATA DIVISION.
        FILE SECTION.
      $EFD FILE = lock
           COPY '/z/y25b31/sp2/lib/fd/fdlock'.

        WORKING-STORAGE SECTION.
           COPY '/z/y25b31/sp2/lib/fd/dblock'.

        01 WS-OK              PIC X(01) VALUE SPACES.
        01 WS-COMMAND         PIC X ANY LENGTH.
        01 S-WINDOW           PIC X(10).
        01 S-WINDOW2          PIC X(10).
        01 S-WINDOW3          PIC X(10).
        01 S-PAUSE            PIC X(01).
        01 S-STATUS-CHECK     PIC X(01).
        01 WS-STATUS          PIC 9(02) VALUE ZEROS.
        01 S-ANSWER           PIC X(01) VALUE 'N'.
           88 VALID-ANSWER   VALUE 'Y', 'y','N', 'n'.
        01 FKEY               PIC 9(03).
           88 FKEY-ENTER     VALUE 013.
           88 FKEY-ESCAPE    VALUE 027.

        01 WS-CTREE-PATH      PIC X(100) VALUE SPACES.
        01 WS-CONFIGURATION   PIC X(100) VALUE SPACES.

        SCREEN SECTION.
        01 SELECT-SCR.
           03 LINE 02 COL 02 'File :'.
           03 COL + 2 PIC X(40) FROM LOCK-DATANAME.
           03 LINE 03 COL 02 'OK to proceed? [ ] [Y/N]'.
           03 LINE 03 COL 19 PIC X(01) USING S-ANSWER BELL UPPER.

        01 SQLIZE-SCR.
           03 BLANK SCREEN.
           03 LINE 02 COL 02 'Sqlize File :'.
           03 COL + 2 PIC X(40) FROM LOCK-DATANAME.
           03 LINE 03 COL 02 'OK to proceed? [ ] [Y/N]'.
           03 LINE 03 COL 19 PIC X(01) USING S-ANSWER BELL UPPER.

        01 PAUSE-SCR.
           03 LINE 02 COL 01 'Press any key to continue ...'.
           03 COL + 2 PIC X(01) USING S-PAUSE AUTO OFF BELL.

        01 PAUSE-SCR2.
           03 LINE 02 COL 01 'Sqlize not successful. Press any key to ex
      -       'it...'.
           03 COL + 2 PIC X(01) USING S-PAUSE AUTO OFF BELL.

      *****************************************************************
       PROCEDURE DIVISION.
        DECLARATIVES.

         USER-FILE-HANDLING SECTION.
           USE AFTER STANDARD ERROR PROCEDURE ON LOCK-FILE.
           CALL   '/v/cps/lib/std/f-status' USING LOCK-DATA.
           CANCEL '/v/cps/lib/std/f-status'.
           MOVE 'Y' TO S-STATUS-CHECK.

        END DECLARATIVES.

      *****************************************************************
        BEGIN.

           DISPLAY FLOATING WINDOW LINES 8 SIZE 60
           CELL SIZE = ENTRY-FIELD FONT SEPARATE
           TITLE 'Lock File Creation'
           POP-UP S-WINDOW.

        ACCEPT-RTN.

           DISPLAY SELECT-SCR.
           ACCEPT  SELECT-SCR.
           ACCEPT  FKEY FROM ESCAPE KEY.

           IF FKEY-ESCAPE GO TO TERMINATION.
           IF NOT (FKEY-ENTER AND VALID-ANSWER) GO TO ACCEPT-RTN.

           IF S-ANSWER NOT = 'Y'
              GO TO TERMINATION.

           OPEN OUTPUT LOCK-FILE.
           CLOSE LOCK-FILE.
           IF S-STATUS-CHECK = 'Y' GO TO TERMINATION.

      * Call to change Mode & Group
           DISPLAY WINDOW AT 0101 SIZE 80 LINES 24
           POP-UP S-WINDOW2.
           DISPLAY OMITTED AT 1516.

           MOVE 'N' TO WS-OK.

           STRING 'chmod 775 ', LOCK-DATANAME, '.dat'
                  DELIMITED BY '  ' INTO WS-COMMAND.
           CALL   'SYSTEM' USING WS-COMMAND GIVING WS-STATUS.
           CANCEL 'SYSTEM'.
           IF WS-STATUS NOT = ZEROS
              DISPLAY PAUSE-SCR
              ACCEPT  PAUSE-SCR
              GO TO BEGIN-SUB.

           STRING 'chgrp cps ', LOCK-DATANAME, '.dat'
                  DELIMITED BY '  ' INTO WS-COMMAND.
           CALL   'SYSTEM' USING WS-COMMAND GIVING WS-STATUS.
           CANCEL 'SYSTEM'.
           IF WS-STATUS NOT = ZEROS
              DISPLAY PAUSE-SCR
              ACCEPT  PAUSE-SCR
              GO TO BEGIN-SUB.

           STRING 'chmod 775 ', LOCK-DATANAME, '.idx'
                  DELIMITED BY '  ' INTO WS-COMMAND.
           CALL   'SYSTEM' USING WS-COMMAND GIVING WS-STATUS.
           CANCEL 'SYSTEM'.
           IF WS-STATUS NOT = ZEROS
              DISPLAY PAUSE-SCR
              ACCEPT  PAUSE-SCR
              GO TO BEGIN-SUB.

           STRING 'chgrp cps ', LOCK-DATANAME, '.idx'
                  DELIMITED BY '  ' INTO WS-COMMAND.
           CALL   'SYSTEM' USING WS-COMMAND GIVING WS-STATUS.
           CANCEL 'SYSTEM'.
           IF WS-STATUS NOT = ZEROS
              DISPLAY PAUSE-SCR
              ACCEPT  PAUSE-SCR
              GO TO BEGIN-SUB.

           MOVE 'Y' TO WS-OK.

        BEGIN-SUB.
           CLOSE WINDOW S-WINDOW2.

           IF WS-OK NOT = 'Y'
              GO TO TERMINATION.

           DESTROY SELECT-SCR.
           INITIALIZE S-ANSWER.

        BEGIN-SUB2.

           DISPLAY SQLIZE-SCR.
           ACCEPT  SQLIZE-SCR.
           ACCEPT FKEY FROM ESCAPE KEY.

           IF FKEY-ESCAPE GO TO TERMINATION.
           IF NOT (FKEY-ENTER AND VALID-ANSWER) GO TO BEGIN-SUB2.

           IF S-ANSWER NOT = 'Y'
              GO TO TERMINATION.

           ACCEPT WS-CTREE-PATH FROM ENVIRONMENT 'PA-CTREE-PATH'.
           ACCEPT WS-CONFIGURATION FROM ENVIRONMENT 'PA-SQL-CONFIG'.

           INITIALIZE WS-STATUS.
           STRING WS-CTREE-PATH, '/ctutil -c ',  WS-CONFIGURATION,
                  ' -sqlize ', LOCK-DATANAME,
                  ' /z/y25b31/sp2/db/lock.iss ctreeSQL31 -conv=A'
                  DELIMITED BY '  ' INTO WS-COMMAND.
           CALL   'SYSTEM' USING WS-COMMAND GIVING WS-STATUS.
           CANCEL 'SYSTEM'.

           IF WS-STATUS NOT = ZEROS
              DISPLAY PAUSE-SCR2
              ACCEPT  PAUSE-SCR2
           ELSE
              DISPLAY MESSAGE "SQLIZE SUCCESSFUL" TITLE 'STATUS'.

        TERMINATION.
           CLOSE WINDOW S-WINDOW.
           EXIT PROGRAM.
           STOP RUN.
      ***************************************************************
      * End of program.
